OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/lib/src/pic16/libdev/pic18f46k80.c
__at(0x0E7E) __sfr BIE0;
__at(0x0E7E) volatile __BIE0bits_t BIE0bits;

__at(0x0E7F) __sfr TXBIE;
__at(0x0E7F) volatile __TXBIEbits_t TXBIEbits;

__at(0x0E80) __sfr B0CON;
__at(0x0E80) volatile __B0CONbits_t B0CONbits;

__at(0x0E81) __sfr B0SIDH;
__at(0x0E81) volatile __B0SIDHbits_t B0SIDHbits;

__at(0x0E82) __sfr B0SIDL;
__at(0x0E82) volatile __B0SIDLbits_t B0SIDLbits;

__at(0x0E83) __sfr B0EIDH;
__at(0x0E83) volatile __B0EIDHbits_t B0EIDHbits;

__at(0x0E84) __sfr B0EIDL;
__at(0x0E84) volatile __B0EIDLbits_t B0EIDLbits;

__at(0x0E85) __sfr B0DLC;
__at(0x0E85) volatile __B0DLCbits_t B0DLCbits;

__at(0x0E86) __sfr B0D0;
__at(0x0E86) volatile __B0D0bits_t B0D0bits;

__at(0x0E87) __sfr B0D1;
__at(0x0E87) volatile __B0D1bits_t B0D1bits;

__at(0x0E88) __sfr B0D2;
__at(0x0E88) volatile __B0D2bits_t B0D2bits;

__at(0x0E89) __sfr B0D3;
__at(0x0E89) volatile __B0D3bits_t B0D3bits;

__at(0x0E8A) __sfr B0D4;
__at(0x0E8A) volatile __B0D4bits_t B0D4bits;

__at(0x0E8B) __sfr B0D5;
__at(0x0E8B) volatile __B0D5bits_t B0D5bits;

__at(0x0E8C) __sfr B0D6;
__at(0x0E8C) volatile __B0D6bits_t B0D6bits;

__at(0x0E8D) __sfr B0D7;
__at(0x0E8D) volatile __B0D7bits_t B0D7bits;

__at(0x0E8E) __sfr CANSTAT_RO9;
__at(0x0E8E) volatile __CANSTAT_RO9bits_t CANSTAT_RO9bits;

__at(0x0E8F) __sfr CANCON_RO9;
__at(0x0E8F) volatile __CANCON_RO9bits_t CANCON_RO9bits;

__at(0x0E90) __sfr B1CON;
__at(0x0E90) volatile __B1CONbits_t B1CONbits;

__at(0x0E91) __sfr B1SIDH;
__at(0x0E91) volatile __B1SIDHbits_t B1SIDHbits;

__at(0x0E92) __sfr B1SIDL;
__at(0x0E92) volatile __B1SIDLbits_t B1SIDLbits;

__at(0x0E93) __sfr B1EIDH;
__at(0x0E93) volatile __B1EIDHbits_t B1EIDHbits;

__at(0x0E94) __sfr B1EIDL;
__at(0x0E94) volatile __B1EIDLbits_t B1EIDLbits;

__at(0x0E95) __sfr B1DLC;
__at(0x0E95) volatile __B1DLCbits_t B1DLCbits;

__at(0x0E96) __sfr B1D0;
__at(0x0E96) volatile __B1D0bits_t B1D0bits;

__at(0x0E97) __sfr B1D1;
__at(0x0E97) volatile __B1D1bits_t B1D1bits;

__at(0x0E98) __sfr B1D2;
__at(0x0E98) volatile __B1D2bits_t B1D2bits;

__at(0x0E99) __sfr B1D3;
__at(0x0E99) volatile __B1D3bits_t B1D3bits;

__at(0x0E9A) __sfr B1D4;
__at(0x0E9A) volatile __B1D4bits_t B1D4bits;

__at(0x0E9B) __sfr B1D5;
__at(0x0E9B) volatile __B1D5bits_t B1D5bits;

__at(0x0E9C) __sfr B1D6;
__at(0x0E9C) volatile __B1D6bits_t B1D6bits;

__at(0x0E9D) __sfr B1D7;
__at(0x0E9D) volatile __B1D7bits_t B1D7bits;

__at(0x0E9E) __sfr CANSTAT_RO8;
__at(0x0E9E) volatile __CANSTAT_RO8bits_t CANSTAT_RO8bits;

__at(0x0E9F) __sfr CANCON_RO8;
__at(0x0E9F) volatile __CANCON_RO8bits_t CANCON_RO8bits;

__at(0x0EA0) __sfr B2CON;
__at(0x0EA0) volatile __B2CONbits_t B2CONbits;

__at(0x0EA1) __sfr B2SIDH;
__at(0x0EA1) volatile __B2SIDHbits_t B2SIDHbits;

__at(0x0EA2) __sfr B2SIDL;
__at(0x0EA2) volatile __B2SIDLbits_t B2SIDLbits;

__at(0x0EA3) __sfr B2EIDH;
__at(0x0EA3) volatile __B2EIDHbits_t B2EIDHbits;

__at(0x0EA4) __sfr B2EIDL;
__at(0x0EA4) volatile __B2EIDLbits_t B2EIDLbits;

__at(0x0EA5) __sfr B2DLC;
__at(0x0EA5) volatile __B2DLCbits_t B2DLCbits;

__at(0x0EA6) __sfr B2D0;
__at(0x0EA6) volatile __B2D0bits_t B2D0bits;

__at(0x0EA7) __sfr B2D1;
__at(0x0EA7) volatile __B2D1bits_t B2D1bits;

__at(0x0EA8) __sfr B2D2;
__at(0x0EA8) volatile __B2D2bits_t B2D2bits;

__at(0x0EA9) __sfr B2D3;
__at(0x0EA9) volatile __B2D3bits_t B2D3bits;

__at(0x0EAA) __sfr B2D4;
__at(0x0EAA) volatile __B2D4bits_t B2D4bits;

__at(0x0EAB) __sfr B2D5;
__at(0x0EAB) volatile __B2D5bits_t B2D5bits;

__at(0x0EAC) __sfr B2D6;
__at(0x0EAC) volatile __B2D6bits_t B2D6bits;

__at(0x0EAD) __sfr B2D7;
__at(0x0EAD) volatile __B2D7bits_t B2D7bits;

__at(0x0EAE) __sfr CANSTAT_RO7;
__at(0x0EAE) volatile __CANSTAT_RO7bits_t CANSTAT_RO7bits;

__at(0x0EAF) __sfr CANCON_RO7;
__at(0x0EAF) volatile __CANCON_RO7bits_t CANCON_RO7bits;

__at(0x0EB0) __sfr B3CON;
__at(0x0EB0) volatile __B3CONbits_t B3CONbits;

__at(0x0EB1) __sfr B3SIDH;
__at(0x0EB1) volatile __B3SIDHbits_t B3SIDHbits;

__at(0x0EB2) __sfr B3SIDL;
__at(0x0EB2) volatile __B3SIDLbits_t B3SIDLbits;

__at(0x0EB3) __sfr B3EIDH;
__at(0x0EB3) volatile __B3EIDHbits_t B3EIDHbits;

__at(0x0EB4) __sfr B3EIDL;
__at(0x0EB4) volatile __B3EIDLbits_t B3EIDLbits;

__at(0x0EB5) __sfr B3DLC;
__at(0x0EB5) volatile __B3DLCbits_t B3DLCbits;

__at(0x0EB6) __sfr B3D0;
__at(0x0EB6) volatile __B3D0bits_t B3D0bits;

__at(0x0EB7) __sfr B3D1;
__at(0x0EB7) volatile __B3D1bits_t B3D1bits;

__at(0x0EB8) __sfr B3D2;
__at(0x0EB8) volatile __B3D2bits_t B3D2bits;

__at(0x0EB9) __sfr B3D3;
__at(0x0EB9) volatile __B3D3bits_t B3D3bits;

__at(0x0EBA) __sfr B3D4;
__at(0x0EBA) volatile __B3D4bits_t B3D4bits;

__at(0x0EBB) __sfr B3D5;
__at(0x0EBB) volatile __B3D5bits_t B3D5bits;

__at(0x0EBC) __sfr B3D6;
__at(0x0EBC) volatile __B3D6bits_t B3D6bits;

__at(0x0EBD) __sfr B3D7;
__at(0x0EBD) volatile __B3D7bits_t B3D7bits;

__at(0x0EBE) __sfr CANSTAT_RO6;
__at(0x0EBE) volatile __CANSTAT_RO6bits_t CANSTAT_RO6bits;

__at(0x0EBF) __sfr CANCON_RO6;
__at(0x0EBF) volatile __CANCON_RO6bits_t CANCON_RO6bits;

__at(0x0EC0) __sfr B4CON;
__at(0x0EC0) volatile __B4CONbits_t B4CONbits;

__at(0x0EC1) __sfr B4SIDH;
__at(0x0EC1) volatile __B4SIDHbits_t B4SIDHbits;

__at(0x0EC2) __sfr B4SIDL;
__at(0x0EC2) volatile __B4SIDLbits_t B4SIDLbits;

__at(0x0EC3) __sfr B4EIDH;
__at(0x0EC3) volatile __B4EIDHbits_t B4EIDHbits;

__at(0x0EC4) __sfr B4EIDL;
__at(0x0EC4) volatile __B4EIDLbits_t B4EIDLbits;

__at(0x0EC5) __sfr B4DLC;
__at(0x0EC5) volatile __B4DLCbits_t B4DLCbits;

__at(0x0EC6) __sfr B4D0;
__at(0x0EC6) volatile __B4D0bits_t B4D0bits;

__at(0x0EC7) __sfr B4D1;
__at(0x0EC7) volatile __B4D1bits_t B4D1bits;

__at(0x0EC8) __sfr B4D2;
__at(0x0EC8) volatile __B4D2bits_t B4D2bits;

__at(0x0EC9) __sfr B4D3;
__at(0x0EC9) volatile __B4D3bits_t B4D3bits;

__at(0x0ECA) __sfr B4D4;
__at(0x0ECA) volatile __B4D4bits_t B4D4bits;

__at(0x0ECB) __sfr B4D5;
__at(0x0ECB) volatile __B4D5bits_t B4D5bits;

__at(0x0ECC) __sfr B4D6;
__at(0x0ECC) volatile __B4D6bits_t B4D6bits;

__at(0x0ECD) __sfr B4D7;
__at(0x0ECD) volatile __B4D7bits_t B4D7bits;

__at(0x0ECE) __sfr CANSTAT_RO5;
__at(0x0ECE) volatile __CANSTAT_RO5bits_t CANSTAT_RO5bits;

